# Nearest Neighbor Item based Collaborative Filtering

In [1]:
import pandas as pd
import numpy as np

In [2]:
movies_df = pd.read_csv('movies.csv', 
                        usecols=['movieId', 'title'],
                        dtype={'movieId':'int32', 'title':'str'})

In [3]:
movies_df.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [4]:
movies_df.shape

(9742, 2)

In [5]:
rating_df = pd.read_csv('ratings.csv',
                        usecols=['userId', 'movieId', 'rating'],
                        dtype={'userId': 'int32', 'movieId': 'int32', 'rating': 'float32'})

In [6]:
rating_df.head()

   userId  movieId  rating
0       1        1     4.0
1       1        3     4.0
2       1        6     4.0
3       1       47     5.0
4       1       50     5.0

In [7]:
rating_df.shape

(100836, 3)

merge movies and rating dataset on `movieId`

In [8]:
df = pd.merge(rating_df, movies_df, on='movieId')
df.head()

   userId  movieId  rating             title
0       1        1     4.0  Toy Story (1995)
1       5        1     4.0  Toy Story (1995)
2       7        1     4.5  Toy Story (1995)
3      15        1     2.5  Toy Story (1995)
4      17        1     4.5  Toy Story (1995)

In [9]:
df.shape

(100836, 4)

In [10]:
movie_rating_count = (df
                      .groupby('title')['rating']
                      .count()
                      .reset_index()
                      .rename(columns={'rating': 'totalRatingCount'})
                      [['title', 'totalRatingCount']]
                     )

   userId  movieId  rating             title
0       1        1     4.0  Toy Story (1995)
1       5        1     4.0  Toy Story (1995)
2       7        1     4.5  Toy Story (1995)
3      15        1     2.5  Toy Story (1995)
4      17        1     4.5  Toy Story (1995)